Tasks/ЗадачаВнешнееПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>ЗадачаВнешнееПроизводство</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОжидаемогоОкончанияПодрядчиком</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставкаНаСклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектТЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадачКонструирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Enums/ТипыЗадачКонструирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЗадачКонструирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнееСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГЧОжидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГЧПроверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоработкаКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольДизайнера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеМенеджером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеФиндиректором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеВедущимКонструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Tasks/ЗадачаВнешнееПроизводство/Forms/ФормаЗадачи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = Объект.Наименование;
	
	ТолькоПросмотр 						= Объект.Выполнена;
	
	Если Объект.Выполнена Тогда
		ТолькоПросмотр = Истина;
		Элементы.ГруппаКнопки.Видимость = Ложь;
	Иначе	
		
		Если Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ВнешнееПКД Тогда
			Элементы.Согласовано.Видимость = Ложь;
		ИначеЕсли Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ВнешнееСогласование Тогда
			Элементы.Контроль.Видимость = Ложь;
		Иначе
			Элементы.Контроль.Видимость = Ложь;
			Элементы.Согласовано.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.Выполнить.Видимость 		= Объект.ТипЗадачи = Перечисления.ТипыЗадачКонструирования.ВнешнееПроизводство;
	Элементы.ФормаЗаписать.Видимость 	= НЕ ТолькоПросмотр;
КонецПроцедуры

&НаКлиенте
Процедура Записать_задачу(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьНаСервере()

	ЗадачаОбъект = Объект.Ссылка.ПолучитьОбъект();
	ЗадачаОбъект.ВыполнитьЗадачу();
	
КонецПроцедуры

&НаКлиенте
Процедура Выполнить_задачу(Команда)
	ВыполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Контроль(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура Согласовано(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
